In [3]:
import pandas as pd
import numpy as np

In [26]:
df = pd.read_csv('exemplo', sep=',')

In [28]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [30]:
df = df + 1

In [32]:
df

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [34]:
df.to_csv("exemplo.csv", sep=';', decimal=',')

In [42]:
df = pd.read_excel('Exemplo_Excel.xlsx', sheet_name='Sheet1')

In [44]:
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [48]:
df.to_excel('Exemplo.xlsx', sheet_name='Sheet1')

In [50]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [54]:
type(df)

list

In [58]:
df[0]['Bank Name']

0       The First National Bank of Lindsay
1    Republic First Bank dba Republic Bank
2                            Citizens Bank
3                 Heartland Tri-State Bank
4                      First Republic Bank
5                           Signature Bank
6                      Silicon Valley Bank
7                        Almena State Bank
8               First City Bank of Florida
9                     The First State Bank
Name: Bank Name, dtype: object